
public class Ex6 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/**
		 *  객체지향 언어
		 *  코드의 재사용성이 높고, 유지보수가 용이하며 중복 코드를 제하는 기술들이 들어가 있다.
		 *  => 빠른 변화에 따라가기 쉽도록 개념과 규칙들이 추가된 것.
		 *  1. 캡슐화
		 *  2. 상속
		 *  3. 추상화
		 *  4. 다형성
		 *  
		 *   클래스의 정의 - 클래스란 객체를 정의해 놓은 것
		 *   클래스의 용도 - 클래스는 객체를 생성하는데 사용
		 *   
		 *   객체의 정의 - 실제로 존재하는 것. 사물 또는 개념
		 *   객체의 용 - 객체가 가지고 있는 기능과 속성에 따라 다름
		 *   클래스 <-> 객체
		 *  (제품 설계도 <-> 제품)
		 *  
		 * 	객체 = 속성(변수) + 기능(메서드). 모든 인스턴스를 대표하는 일반적 용어.
		 * 	인스턴스 = 특정 클래스로부터 생성된 객체( ex. Tv 인스턴스)
		 * 
		 *	클래스  ->  인스턴스(객체)
		 *		(인스턴스화)
		 *  
		 *
		 * 하나의 소스파일에 여러 클래스 작성
		 * - public class가 있는 경우: 소스파일의 이름은 반드시 public class의 이름과일치해야 한다.
		 * - public class가 없는 경우: 소스파일의 이름은 class들의 이름 모두가 가능하다.
		 */

	}

}
