
public class Ex7_10 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		/**
		 *  변수의 초기화
		 *  - 지역변수(lv)는 수동 초기화 해야함
		 *  - 멤버 변수(iv, cv)는 자동 초기화 된다.
		 *  
		 *  멤버 변수의 초기화
		 *  1. 명시적 초기화(선언시 대입연산다 '=' 를 이용)
		 *  2. 초기화 블럭
		 *  - 인스턴스 초기화 블럭 : {}
		 *  - 클래스 초기화 블럭 : static {} 
		 *  3. 생성자
		 *  - iv 초기화, 복잡한 초기화에 사용
		 *  
		 *  - 클래스 변수 초기화 시점 : 클래스가 처음 로딩될 때 단 한번(메모리에 올라갈 때)
		 *  - 인스턴스 변수 초기화 시점: 인스턴스가 생성될 때 마다
		 *  - cv -> iv / 자동 -> 간단 -> 복잡 순서로 초기화
		 */
	}

}